project-properties.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Project Properties</title>
<!-- 2013-10-13 Sun 19:01 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="Ioannis Zannos"/>

<link rel="stylesheet" href="./css/org.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">Project Properties</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">config.org options</a></li>
<li><a href="#sec-2">style</a></li>
<li><a href="#sec-3">headline-levels: 2</a></li>
<li><a href="#sec-4">link-up: ""</a></li>
<li><a href="#sec-5">link-home:  ""</a></li>
<li><a href="#sec-6">language: "en"</a></li>
<li><a href="#sec-7">customtime: t</a></li>
<li><a href="#sec-8">headline-levels: 2</a></li>
<li><a href="#sec-9">section-numbers: nil</a></li>
<li><a href="#sec-10">section-number-format: '((("1" ".")) . "")</a></li>
<li><a href="#sec-11">table-of-contents: t</a></li>
<li><a href="#sec-12">preserve-breaks: nil</a></li>
<li><a href="#sec-13">archived-trees: nil</a></li>
<li><a href="#sec-14">emphasize: t</a></li>
<li><a href="#sec-15">sub-superscript: nil</a></li>
<li><a href="#sec-16">special-strings: nil</a></li>
<li><a href="#sec-17">footnotes: t</a></li>
<li><a href="#sec-18">drawers: t</a></li>
<li><a href="#sec-19">tags: nil</a></li>
<li><a href="#sec-20">todo-keywords: nil</a></li>
<li><a href="#sec-21">priority: nil</a></li>
<li><a href="#sec-22">TeX-macros: nil</a></li>
<li><a href="#sec-23">LaTeX-fragments: nil</a></li>
<li><a href="#sec-24">latex-listings: nil</a></li>
<li><a href="#sec-25">skip-before-1st-heading: nil</a></li>
<li><a href="#sec-26">fixed-width: nil</a></li>
<li><a href="#sec-27">timestamps: nil</a></li>
<li><a href="#sec-28">author-info: t</a></li>
<li><a href="#sec-29">creator-info: t</a></li>
<li><a href="#sec-30">tables: t</a></li>
<li><a href="#sec-31">table-auto-headline: t</a></li>
<li><a href="#sec-32">style-include-default: nil</a></li>
<li><a href="#sec-33">style</a></li>
<li><a href="#sec-34">style-extra: ""</a></li>
<li><a href="#sec-35">convert-org-links: t</a></li>
<li><a href="#sec-36">inline-images: 'maybe</a></li>
<li><a href="#sec-37">html-extension: "html"</a></li>
<li><a href="#sec-38">xml-declaration: '(("html" . "&lt;?xml version=\"1.0\" encoding=\"%s\"?&gt;") ("php" . "&lt;?php echo \"&lt;?xml version=\\\"1.0\\\" encoding=\\\"%s\\\" ?&gt;\"; ?&gt;"))</a></li>
<li><a href="#sec-39">html-table-tag</a></li>
<li><a href="#sec-40">expand-quoted-html'   `org-export-html-expand'</a></li>
<li><a href="#sec-41">timestamp'            `org-export-html-with-timestamp'</a></li>
<li><a href="#sec-42">publishing-directory' `org-export-publishing-directory'</a></li>
<li><a href="#sec-43">preamble'             `org-export-html-preamble'</a></li>
<li><a href="#sec-44">postamble'            `org-export-html-postamble'</a></li>
<li><a href="#sec-45">auto-preamble'        `org-export-html-auto-preamble'</a></li>
<li><a href="#sec-46">auto-postamble'       `org-export-html-auto-postamble'</a></li>
<li><a href="#sec-47">author'               `user-full-name'</a></li>
<li><a href="#sec-48">email'                `user-mail-address' : `addr;addr;..'</a></li>
<li><a href="#sec-49">select-tags'          `org-export-select-tags'</a></li>
<li><a href="#sec-50">exclude-tags'         `org-export-exclude-tags'</a></li>
<li><a href="#sec-51">latex-image-options'  `org-export-latex-image-default-option'</a></li>
<li><a href="#sec-52">file header options</a></li>
<li><a href="#sec-53">title: "the title to be shown (default is the buffer name)"</a></li>
<li><a href="#sec-54">author:  "the author (default taken from `user-full-name')"</a></li>
<li><a href="#sec-55">date:  "15.5.2011" (note: the doc says: "a date, fixed, of a format string for `format-time-string'"</a></li>
<li><a href="#sec-56">email:  "john@doe.info" (default from `user-mail-address')</a></li>
<li><a href="#sec-57">description</a></li>
<li><a href="#sec-58">keywords</a></li>
<li><a href="#sec-59">language:  "en" (language for HTML, e.g. `en' (`org-export-default-language'))</a></li>
<li><a href="#sec-60">text</a></li>
<li><a href="#sec-61">options: "H:2 num:t toc:t \n:nil @:t ::t |:t ^:t f:t TeX:t"</a></li>
<li><a href="#sec-62">bind:        lisp-var lisp-val, e.g.: org-export-latex-low-levels itemize</a></li>
<li><a href="#sec-63">link_up:   "../" ;; note: this is the relative path to the folder immediately above the current folder</a></li>
<li><a href="#sec-64">link_home: "." ;; note: . creates a relative path to the root folder of the current project</a></li>
<li><a href="#sec-65">latex_header</a></li>
<li><a href="#sec-66">export_select_tags: "export"</a></li>
<li><a href="#sec-67">export_exclude_tags: "exclude"</a></li>
<li><a href="#sec-68">Individual File Properties</a></li>
</ul>
</div>
</div>
<p>
Following project properties are collected for reference from chapters <i>13.1.5 Options for the HTML/LaTeX exporters</i> and 
<i>12.2 Export options</i> of org-info.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">config.org options</h2>
<div class="outline-text-2" id="text-1">
<p>
@&lt;b&gt;These options (properties) are defined in config.org and are inherited in all files of a project and of its subprojects, unless overwitten by <a href="#sec-68">Individual File Properties</a> (see next section).@&lt;/b&gt;
</p>

<p>
Org-info manual section, <i>13.1.5 Options for the HTML/LaTeX exporters</i>, refers to the options that are defined via a project's property list. In DynOrg, these properties are defined in the config.org file that is in the top folder of each project. The name of each property is given through the name of an org node, and the value of the property is given by the text that follows it. If the value is a string, it is given as the contents of the node, like this: 
</p>

<p>
#+BEGIN_EXAMPLE
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">style</h2>
<div class="outline-text-2" id="text-2">
<p>
&lt;link rel="stylesheet" href="./css/org.css" type="text/css"/&gt;
#+END_EXAMPLE
</p>

<p>
If the value is a short, one-line string or some lisp object (function, number, symbol, etc.) then the name of the property is followed by ":" and the value is given on the same line as the name of the property, like this: 
</p>

<p>
#+BEGIN_EXAMPLE
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">headline-levels: 2</h2>
<div class="outline-text-2" id="text-3">
<p>
#+END_EXAMPLE
</p>

<p>
The options that can be used in the config.org file are shown in the following example: 
</p>

<p>
#+BEGIN_EXAMPLE
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">link-up: "<a href="http://somesite.net/chapter1">http://somesite.net/chapter1</a>"</h2>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">link-home:  "<a href="http://somesite.net/">http://somesite.net/</a>"</h2>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">language: "en"</h2>
</div>
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">customtime: t</h2>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">headline-levels: 2</h2>
</div>
<div id="outline-container-sec-9" class="outline-2">
<h2 id="sec-9">section-numbers: nil</h2>
</div>
<div id="outline-container-sec-10" class="outline-2">
<h2 id="sec-10">section-number-format: '((("1" ".")) . "")</h2>
</div>
<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11">table-of-contents: t</h2>
</div>
<div id="outline-container-sec-12" class="outline-2">
<h2 id="sec-12">preserve-breaks: nil</h2>
</div>
<div id="outline-container-sec-13" class="outline-2">
<h2 id="sec-13">archived-trees: nil</h2>
</div>
<div id="outline-container-sec-14" class="outline-2">
<h2 id="sec-14">emphasize: t</h2>
</div>
<div id="outline-container-sec-15" class="outline-2">
<h2 id="sec-15">sub-superscript: nil</h2>
</div>
<div id="outline-container-sec-16" class="outline-2">
<h2 id="sec-16">special-strings: nil</h2>
</div>
<div id="outline-container-sec-17" class="outline-2">
<h2 id="sec-17">footnotes: t</h2>
</div>
<div id="outline-container-sec-18" class="outline-2">
<h2 id="sec-18">drawers: t</h2>
</div>
<div id="outline-container-sec-19" class="outline-2">
<h2 id="sec-19">tags: nil</h2>
</div>
<div id="outline-container-sec-20" class="outline-2">
<h2 id="sec-20">todo-keywords: nil</h2>
</div>
<div id="outline-container-sec-21" class="outline-2">
<h2 id="sec-21">priority: nil</h2>
</div>
<div id="outline-container-sec-22" class="outline-2">
<h2 id="sec-22">TeX-macros: nil</h2>
</div>
<div id="outline-container-sec-23" class="outline-2">
<h2 id="sec-23">LaTeX-fragments: nil</h2>
</div>
<div id="outline-container-sec-24" class="outline-2">
<h2 id="sec-24">latex-listings: nil</h2>
</div>
<div id="outline-container-sec-25" class="outline-2">
<h2 id="sec-25">skip-before-1st-heading: nil</h2>
</div>
<div id="outline-container-sec-26" class="outline-2">
<h2 id="sec-26">fixed-width: nil</h2>
</div>
<div id="outline-container-sec-27" class="outline-2">
<h2 id="sec-27">timestamps: nil</h2>
</div>
<div id="outline-container-sec-28" class="outline-2">
<h2 id="sec-28">author-info: t</h2>
</div>
<div id="outline-container-sec-29" class="outline-2">
<h2 id="sec-29">creator-info: t</h2>
</div>
<div id="outline-container-sec-30" class="outline-2">
<h2 id="sec-30">tables: t</h2>
</div>
<div id="outline-container-sec-31" class="outline-2">
<h2 id="sec-31">table-auto-headline: t</h2>
</div>
<div id="outline-container-sec-32" class="outline-2">
<h2 id="sec-32">style-include-default: nil</h2>
</div>
<div id="outline-container-sec-33" class="outline-2">
<h2 id="sec-33">style</h2>
<div class="outline-text-2" id="text-33">
<p>
&lt;link rel="stylesheet" href="./css/org.css" type="text/css"/&gt;
</p>
</div>
</div>

<div id="outline-container-sec-34" class="outline-2">
<h2 id="sec-34">style-extra: ""</h2>
</div>
<div id="outline-container-sec-35" class="outline-2">
<h2 id="sec-35">convert-org-links: t</h2>
</div>
<div id="outline-container-sec-36" class="outline-2">
<h2 id="sec-36">inline-images: 'maybe</h2>
</div>
<div id="outline-container-sec-37" class="outline-2">
<h2 id="sec-37">html-extension: "html"</h2>
</div>
<div id="outline-container-sec-38" class="outline-2">
<h2 id="sec-38">xml-declaration: '(("html" . "&lt;?xml version=\"1.0\" encoding=\"%s\"?&gt;") ("php" . "&lt;?php echo \"&lt;?xml version=\\\"1.0\\\" encoding=\\\"%s\\\" ?&gt;\"; ?&gt;"))</h2>
</div>
<div id="outline-container-sec-39" class="outline-2">
<h2 id="sec-39">html-table-tag</h2>
<div class="outline-text-2" id="text-39">
<p>
&lt;table border="2" cellspacing="0" cellpadding=\"6\" rules=\"groups\" frame=\"hsides\"&gt;
</p>
</div>
</div>

<div id="outline-container-sec-40" class="outline-2">
<h2 id="sec-40">expand-quoted-html'   `org-export-html-expand'</h2>
</div>
<div id="outline-container-sec-41" class="outline-2">
<h2 id="sec-41">timestamp'            `org-export-html-with-timestamp'</h2>
</div>
<div id="outline-container-sec-42" class="outline-2">
<h2 id="sec-42">publishing-directory' `org-export-publishing-directory'</h2>
</div>
<div id="outline-container-sec-43" class="outline-2">
<h2 id="sec-43">preamble'             `org-export-html-preamble'</h2>
</div>
<div id="outline-container-sec-44" class="outline-2">
<h2 id="sec-44">postamble'            `org-export-html-postamble'</h2>
</div>
<div id="outline-container-sec-45" class="outline-2">
<h2 id="sec-45">auto-preamble'        `org-export-html-auto-preamble'</h2>
</div>
<div id="outline-container-sec-46" class="outline-2">
<h2 id="sec-46">auto-postamble'       `org-export-html-auto-postamble'</h2>
</div>
<div id="outline-container-sec-47" class="outline-2">
<h2 id="sec-47">author'               `user-full-name'</h2>
</div>
<div id="outline-container-sec-48" class="outline-2">
<h2 id="sec-48">email'                `user-mail-address' : `addr;addr;..'</h2>
</div>
<div id="outline-container-sec-49" class="outline-2">
<h2 id="sec-49">select-tags'          `org-export-select-tags'</h2>
</div>
<div id="outline-container-sec-50" class="outline-2">
<h2 id="sec-50">exclude-tags'         `org-export-exclude-tags'</h2>
</div>
<div id="outline-container-sec-51" class="outline-2">
<h2 id="sec-51">latex-image-options'  `org-export-latex-image-default-option'</h2>
</div>
<div id="outline-container-sec-52" class="outline-2">
<h2 id="sec-52">file header options</h2>
<div class="outline-text-2" id="text-52">
<p>
#+END_EXAMPLE
</p>

<p>
#+BEGIN_EXAMPLE
</p>
</div>
</div>

<div id="outline-container-sec-53" class="outline-2">
<h2 id="sec-53">title: "the title to be shown (default is the buffer name)"</h2>
</div>
<div id="outline-container-sec-54" class="outline-2">
<h2 id="sec-54">author:  "the author (default taken from `user-full-name')"</h2>
</div>
<div id="outline-container-sec-55" class="outline-2">
<h2 id="sec-55">date:  "15.5.2011" (note: the doc says: "a date, fixed, of a format string for `format-time-string'"</h2>
</div>
<div id="outline-container-sec-56" class="outline-2">
<h2 id="sec-56">email:  "john@doe.info" (default from `user-mail-address')</h2>
</div>
<div id="outline-container-sec-57" class="outline-2">
<h2 id="sec-57">description</h2>
<div class="outline-text-2" id="text-57">
<p>
the page description, e.g. for the XHTML meta tag
</p>
</div>
</div>

<div id="outline-container-sec-58" class="outline-2">
<h2 id="sec-58">keywords</h2>
<div class="outline-text-2" id="text-58">
<p>
the page keywords, e.g. for the XHTML meta tag
</p>
</div>
</div>

<div id="outline-container-sec-59" class="outline-2">
<h2 id="sec-59">language:  "en" (language for HTML, e.g. `en' (`org-export-default-language'))</h2>
</div>
<div id="outline-container-sec-60" class="outline-2">
<h2 id="sec-60">text</h2>
<div class="outline-text-2" id="text-60">
<p>
Some descriptive text to be inserted at the beginning.
Several lines may be given.
</p>
</div>
</div>

<div id="outline-container-sec-61" class="outline-2">
<h2 id="sec-61">options: "H:2 num:t toc:t \n:nil @:t ::t |:t ^:t f:t TeX:t"</h2>
<div class="outline-text-2" id="text-61">
<p>
(See below for explanation. I am not sure how the options are to be entered. As one string or how else? 
Besides, many of these options are covered by pub
</p>
</div>
</div>

<div id="outline-container-sec-62" class="outline-2">
<h2 id="sec-62">bind:        lisp-var lisp-val, e.g.: org-export-latex-low-levels itemize</h2>
<div class="outline-text-2" id="text-62">
<p>
You need to confirm using these, or configure `org-export-allow-BIND'
</p>
</div>
</div>

<div id="outline-container-sec-63" class="outline-2">
<h2 id="sec-63">link_up:   "../" ;; note: this is the relative path to the folder immediately above the current folder</h2>
</div>
<div id="outline-container-sec-64" class="outline-2">
<h2 id="sec-64">link_home: "." ;; note: . creates a relative path to the root folder of the current project</h2>
</div>
<div id="outline-container-sec-65" class="outline-2">
<h2 id="sec-65">latex_header</h2>
<div class="outline-text-2" id="text-65">
<p>
extra line(s) for the LaTeX header, like \usepackage{xyz}
</p>
</div>
</div>

<div id="outline-container-sec-66" class="outline-2">
<h2 id="sec-66">export_select_tags: "export"</h2>
</div>
<div id="outline-container-sec-67" class="outline-2">
<h2 id="sec-67">export_exclude_tags: "exclude"</h2>
<div class="outline-text-2" id="text-67">
<p>
#+END_EXAMPLE
</p>

<p>
The examples above are given in org format as they should be written in a config.org. 
</p>

<p>
Here are the items that can go in the "OPTIONS" line or node above. See examples in org-info for details about how to write these: 
</p>

<pre class="example">
     H:         set the number of headline levels for export
     num:       turn on/off section-numbers
     toc:       turn on/off table of contents, or set level limit (integer)
     \n:        turn on/off line-break-preservation
     @:         turn on/off quoted HTML tags
     ::         turn on/off fixed-width sections
     |:         turn on/off tables
     ^:         turn on/off TeX-like syntax for sub- and superscripts.  If
                you write "^:{}", `a_{b}' will be interpreted, but
                the simple `a_b' will be left as it is.
     -:         turn on/off conversion of special strings.
     f:         turn on/off footnotes like this[1].
     todo:      turn on/off inclusion of TODO keywords into exported text
     pri:       turn on/off priority cookies
     tags:      turn on/off inclusion of tags, may also be `not-in-toc'
     &lt;:         turn on/off inclusion of any time/date stamps like DEADLINES
     *:         turn on/off emphasized text (bold, italic, underlined)
     TeX:       turn on/off simple TeX macros in plain text
     LaTeX:     turn on/off LaTeX fragments
     skip:      turn on/off skipping the text before the first heading
     author:    turn on/off inclusion of author name/email into exported file
     creator:   turn on/off inclusion of creator info into exported file
     timestamp: turn on/off inclusion creation time into exported file
     d:         turn on/off inclusion of drawers
   These options take effect in both the HTML and LaTeX export, except
for `TeX' and `LaTeX', which are respectively `t' and `nil' for the
LaTeX export.
</pre>
</div>
</div>
<div id="outline-container-sec-68" class="outline-2">
<h2 id="sec-68">Individual File Properties</h2>
<div class="outline-text-2" id="text-68">
<p>
These options are inserted using org property format at the top of the file that they concern, and they set the properties only for that file. A template of such options can be inserted at the current cursor point of an org file by running the command C-c C-e t (org-insert-export-options-template).
</p>

<p>
The following is quoted from section 12.2 Export options of the org info manual.
</p>

<pre class="example">
#+TITLE:       the title to be shown (default is the buffer name)
#+AUTHOR:      the author (default taken from `user-full-name')
#+DATE:        a date, fixed, of a format string for `format-time-string'
#+EMAIL:       his/her email address (default from `user-mail-address')
#+DESCRIPTION: the page description, e.g. for the XHTML meta tag
#+KEYWORDS:    the page keywords, e.g. for the XHTML meta tag
#+LANGUAGE:    language for HTML, e.g. `en' (`org-export-default-language')
#+TEXT:        Some descriptive text to be inserted at the beginning.
#+TEXT:        Several lines may be given.
#+OPTIONS:     H:2 num:t toc:t \n:nil @:t ::t |:t ^:t f:t TeX:t ...
#+BIND:        lisp-var lisp-val, e.g.: org-export-latex-low-levels itemize
               You need to confirm using these, or configure `org-export-allow-BIND'
#+LINK_UP:     the ``up'' link of an exported page
#+LINK_HOME:   the ``home'' link of an exported page
#+LATEX_HEADER: extra line(s) for the LaTeX header, like \usepackage{xyz}
#+EXPORT_SELECT_TAGS:   Tags that select a tree for export
#+EXPORT_EXCLUDE_TAGS:  Tags that exclude a tree from export
</pre>
<p>
The OPTIONS line is a compact(1) form to specify export settings.  Here you can:
</p>

<pre class="example">
H:         set the number of headline levels for export
num:       turn on/off section-numbers
toc:       turn on/off table of contents, or set level limit (integer)
\n:        turn on/off line-break-preservation
@:         turn on/off quoted HTML tags
::         turn on/off fixed-width sections
|:         turn on/off tables
^:         turn on/off TeX-like syntax for sub- and superscripts.  If
           you write "^:{}", `a_{b}' will be interpreted, but
           the simple `a_b' will be left as it is.
-:         turn on/off conversion of special strings.
f:         turn on/off footnotes like this[1].
todo:      turn on/off inclusion of TODO keywords into exported text
pri:       turn on/off priority cookies
tags:      turn on/off inclusion of tags, may also be `not-in-toc'
&lt;:         turn on/off inclusion of any time/date stamps like DEADLINES
*:         turn on/off emphasized text (bold, italic, underlined)
TeX:       turn on/off simple TeX macros in plain text
LaTeX:     turn on/off LaTeX fragments
skip:      turn on/off skipping the text before the first heading
author:    turn on/off inclusion of author name/email into exported file
creator:   turn on/off inclusion of creator info into exported file
timestamp: turn on/off inclusion creation time into exported file
d:         turn on/off inclusion of drawers
</pre>

<p>
These options take effect in both the HTML and LaTeX export, except
for `TeX' and `LaTeX', which are respectively `t' and `nil' for the
LaTeX export.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Ioannis Zannos</p>
<p class="date">Created: 2013-10-13 Sun 19:01</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.0.7)</p>
<p class="xhtml-validation"><a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a></p>
</div>
</body>
</html>
